// @file
//
//Copyright (c) 2006 - 2011, Byosoft Corporation.<BR> 
//All rights reserved.This software and associated documentation (if any)
//is furnished under a license and may only be used or copied in 
//accordance with the terms of the license. Except as permitted by such
//license, no part of this software or documentation may be reproduced, 
//stored in a retrieval system, or transmitted in any form or by any 
//means without the express written consent of Byosoft Corporation.
//
//File Name:
//  tcmSetup.uni
//
//Abstract: 
//  Dxe part of TCM Module.
//
//Revision History:
//
//Bug 3075 - Add TCM support.
//TIME: 2011-11-14
//$AUTHOR: Zhang Lin
//$REVIEWERS: 
//$SCOPE: SugarBay
//$TECHNICAL: 
//  1. Tcm module init version.
//     Only support setup function.
//$END--------------------------------------------------------------------
//
//



///*++
//Copyright (c) 2010 Intel Corporation. All rights reserved.
//This software and associated documentation (if any) is furnished
//under a license and may only be used or copied in accordance
//with the terms of the license. Except as permitted by such
//license, no part of this software or documentation may be
//reproduced, stored in a retrieval system, or transmitted in any
//form or by any means without the express written consent of
//Intel Corporation.
//
//Module Name:
//
//  TcgSetup.uni
//
//Abstract:
//
// TcgSetup  Setup strings.
//--*/
/=#

#langdef   en-US "en-USlish"
//#langdef   fr-FR "Français"
#langdef   zh-Hans "\wide中文\narrow"

// TPM 
#string STR_TCM_TITLE                      #language en-US "TCM"
                                           #language zh-Hans "TCM\wide管理\narrow"
                                           
#string STR_TCM_HELP                       #language en-US "Press <Enter> to select the TCM Setup options."
                                           #language zh-Hans "\wide按\narrow<Enter>\wide选择\narrowTCM\wide设置选项\narrow"

#string STR_TCM_DEVICE_PROMPT              #language en-US   "TCM Enable/Disable"
                                           #language zh-Hans "TCM\wide使能\narrow/\wide禁止\narrow"
                                           
#string STR_TCM_DEVICE_HELP                #language en-US "Enable/Disable TCM"
                                           #language zh-Hans "\wide使能\narrow/\wide禁止\narrowTCM.\narrow"

#string STR_TCM_FORCE_CLEAR_PROMPT         #language en-US   "TCM Reset"
                                           #language zh-Hans "TCM\wide重置\narrow"
#string STR_TCM_FORCE_CLEAR_HELP           #language en-US   "TCM Reset"
                                           #language zh-Hans "TCM\wide重置后所有预期值将被清除！\narrow"

#string STR_ENABLE                         #language en-US  "Enable"
                                           #language zh-Hans "\wide打开\narrow"
#string STR_DISABLE                        #language en-US  "Disable"
                                           #language zh-Hans "\wide关闭\narrow"
                                           
#string STR_EMPTY                          #language en-US ""
                                           #language zh-Hans ""
                                           
#string STR_YES                            #language en-US  "YES"
                                           #language zh-Hans "\wide是\narrow"
#string STR_NO                             #language en-US  "NO"
                                           #language zh-Hans "\wide否\narrow"                                           
                                           